package com.sola.android.architecture.domain.utils;

/**
 * Created by 禄骥
 * 2016/4/25.
 */
public interface IDownloadListener {
    // ===========================================================
    // Constants
    // ===========================================================

    // ===========================================================
    // Methods for/from SuperClass/Interfaces
    // ===========================================================

    // ===========================================================
    // Methods
    // ===========================================================

    /**
     * 响应回调
     *
     * @param params 传参
     */
    void onResponse(Object... params);

}
